Repository: 84000/translation-memory-resources
Catalog: post_input/toh94-C.bo.en.tmx
Source language: bo
Languages: en

source: བདེ་གཤེགས་ རྣམ་པར་ སྣང་ མཛད་ ཁར་བ་ མཁན །_། གྱུར་ ཚེ་ བདེ་གཤེགས་ མི་ ཡི་ གཟི་བྱིན་ ལ །_། མེ་ལོང་ གཅིག་ཅིག་ དབུལ་བ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $181 “The well-gone Vairocana, when a metal worker, |#| Offered a mirror |#| To the well-gone Gift of the Splendor of Humanity |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ རིན་ཆེན་ ཏོག་ ནི་ ནོར་བུ་ མཁན་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བསོད་ནམས་ སྟེགས་ བཟང་ ལ །_། ནོར་བུ་ དག་ ནི་ དབུལ་བ་ བྱས་ ནས་ |#| ཀྱང་ །_། [297a] དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $182 “The well-gone Ratnaketu, when a jeweler, |#| Offered gems |#| To the thus-gone Excellent Staircase of Merit [297.a] |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཐེ་ཙོམ་ སྤངས་པ་ རྒྱལ་པོ་ ཡི །_། བཙུན་མོ ར་ གྱུར་ ཚེ་ བདེ་གཤེགས་ བརྩོན་ བརྟན་ ལ །_། མེ་ཏོག་ སྐྱེད་མོས་ཚལ་ དག་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $183 “The well-gone Vigatakāṅkṣa, when the consort of a king, |#| Offered flower gardens |#| To the well-gone Steadfast Diligence |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ འཇིག་རྟེན་ འདས་པ་ མ་ མི་ཁ ར །_། གྱུར་ ཚེ་ བདེ་གཤེགས་ ཐུབ་པ ར་ གྲགས་ དེ་ |#| ལ །_། དབུ་ ཞུ་ གཅིག་ཅིག་ དབུལ་བ་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $184 “The well-gone Lokottīrṇa, when mamikha,#170 |#| Offered a head covering#171 |#| To the well-gone Renowned as a Sage |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ དོན་ཡོད་ རྣམ་གནོན་ མི་མཇེད་ བདག _། ཚངས་ ཚེ་ བདེ་གཤེགས་ གྲགས་པ་ རྒྱལ་མཚན་ ལ །_། ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ ར་ གསོལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $185 “The well-gone Amoghavikramin, when Brahmā Sahāmpati, |#| Requested the turning of the Dharma wheel |#| From the well-gone Banner of Fame |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ རྟོགས་པ ར་ མཛད་པ་པོ ས །_། དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་ འོད་ དེ་ ལ །_། སྤོས་ ཀྱི་ རི་ལུ་ དག་ ནི་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $186 “The thus-gone Vibodhana |#| Offered balls of incense |#| To the thus-gone Light of the Worthy Ones |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ མེ་ཏོག་རྒྱལ་ མཚན་ རྒྱལ་བུ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཀུན་ ནས་ གསལ་ དེ་ |#| ལ །_། རྩྭ་ ཡིས་ བཀབ་པ འི་ ཁང་ བཟངས་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $187 “The well-gone Puṣpaketu, when a prince, |#| Offered a mansion thatched with grass |#| To the thus-gone Thoroughly Clear |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ རི་དབང་ རྒྱལ་པོ་ འདྲེག་ མཁན་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ གཟི་བརྗིད་ ཆེ་ དེ་ ཡི །_། དབུ་སྐྲ་ ལེགས་པ ར་ བྲེག་པ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $188 “The well-gone Śailendrarāja, when a barber, |#| Shaved the head |#| Of the thus-gone Great Splendor |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ གཟི་བརྗིད་ ཆེན་པོ་ འབྲུ་མར་ མཁན །_། གྱུར་ ཚེ་ བདེ་གཤེགས་ དགྲ་བཅོམ་ མཆོད་འོས་ ཀྱི །_། གཙུག་ལག་ཁང་ དུ་ སྤོས་ བསྒོས་ འབྲུ་མར་ ཕུལ །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $189 “The well-gone Mahātejas, when an oil producer, |#| Offered in a temple oil infused with fragrance |#| To the well-gone Worthy of Worship |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ དོན་ མཛད་ གཟིགས་པ་ ཏ་ལ་བ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ དཔལ་ གྱི་ མཆོག་ དེ་ ལ །_། ལྷང་ ཚེ ར་ ལེབ་ལེབ་པོ་ དག་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $190 “The well-gone Kṛtārthadarśin, when patalba,#172 |#| Offered shining mica |#| To the thus-gone Supreme Glory |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ གྲགས་པ་ མཐའ་ ཡ ས་ འཁོར་ལོ ས་ སྒྱུར་ རྒྱལ་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ དོན་གྲུབ་ སེམས་དཔའ་ དེ་ ལ་ ནི །_། འཛམ་བུ འི་ ཆུ་བོ འི་ གསེར་ གྱི་ གདུགས་ སྟོང་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ་ ཉིད་ དུ་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $191 “The well-gone Amitayaśas, when a universal monarch, |#| Offered one thousand parasols of gold from the Jambu River |#| To the thus-gone Hero of Accomplished Objectives |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ རིན་ཆེན་ ལྷ་ ནི་ འཛམ་གླིང་ གི །_། རྒྱལ་པོ ར་ གྱུར་ ཚེ་ དེ་བཞིན་ གཤེགས་པ་ དགའས་ མཆོད་ ལ །_། [297b] འབྲས་བུ འི་ སྐྱེད་མོས་ཚལ་ དག་ དབུལ་བ་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ་ ཉིད་ དུ་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $192 “The thus-gone Ratnadeva, when the king of Jambudvīpa, |#| Offered orchard gardens [297.b] |#| To the thus-gone Worshiped with Joy |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ དོན་གནས་ མཁྱེན་པ་ ཆང་ འཚོང་ གི །_། བུར་ གྱུར་ ཚེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཀུན་ ཏུ་ སྦེད །_། སྲང་ དུ་ གཤེགས་ ཚེ་ ཐལ་མོ་ སྦྱར་ ཏེ་ ཕྱག་ བྱས་ ནས །_། |#| དང་པོ་ ཉིད་ དུ་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $193 “The thus-gone Sthitārtha­jñānin, when the son of an alcohol vendor, |#| Joined his palms in homage |#| Before the thus-gone Thoroughly Hidden as he passed through the street |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ བློ་ རྫོགས་ རྒྱལ་བུ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ རབ་ཏུ་ དང་བ་ ལ །_། མེ་ཏོག་ དག་ ལས་ བྱས་པ འི་ གདུགས་ ཕུལ་ ནས །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $194 “The thus-gone Pūrṇamati, when a prince, |#| Offered a parasol made of flowers |#| To the thus-gone Highest Brightness |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ མྱ་ངན་མེད་པ་ དཔའ་བོ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བློ་གྲོས་ སེམས་པ་ དེ །_། |#| འཇིགས་པ་ མེད་པ འི་ ཚུལ་ གྱིས་ སྤྱན་ དྲངས་ ནས །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $195 “The well-gone Aśoka, when a hero, |#| Invited without fear |#| The thus-gone Intelligent Mind |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ དྲི་མ་ བྲལ་བ་ ཡིས །_། སེམས་ཅན་ ཀུན་ ལ་ ཡུད་ཙམ་ བྱམས་ བསྒོམས་ ནས །_། |#| དེ་བཞིན་ གཤེགས་པ་ ངེས་ བྱུང་ བློ་ དེ་ ལ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $196 “The thus-gone Vigatamala |#| Cultivated love for all sentient beings in an instant |#| Before the thus-gone Mind of Renunciation |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ ཚངས་ ལྷ་ཤིང་ སྲུངས་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ལྷུན་པོ འི་ དབྱངས་ དེ་ ལ །_། བུ་རམ་ཤིང་ གི་ སྡོང་བུ་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $197 “The thus-gone Brahmadeva, when a forest guard, |#| Offered a sugarcane trunk |#| To the thus-gone Majestic Melody |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ ས་ ཡི་ དབང་ཕྱུག་ ནི །_། དགེ་སློང་ གྱུར་ ཚེ་ དེ་བཞིན་ གཤེགས་པ་པོ །_། སྣ་ཚོགས་ གསུང་བ འི་ ཆོས་ གདན་ བཏིང་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $198 “The thus-gone Dharaṇīśvara, when a monk, |#| Prepared a Dharma seat |#| For the thus-gone Diverse Teaching |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ མེ་ཏོག་ སྤྱན་ ནི་ རྒྱལ་པོ་ ཡི །_། མིར་ གྱུར་ ཚེ་ ན་ བདེ་གཤེགས་ འབྲུག་སྒྲ་ ལ །_། ཨུད་ པལ་ དམར་པོ་ དག་ ནི་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $199 “The well-gone Kusumanetra, when a royal servant, |#| Offered red utpalas |#| To the well-gone Sound of Thunder |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ རྣམ་ འབྱེས་ སྐུ་ ནི་ བཙོ་བླག་ མཁན །_། གྱུར་ ཚེ་ བདེ་གཤེགས་ འོད་ ཆེན་ ཕུང་པོ་ ཡི །_། ན་བཟའ་ དག་ ནི་ བཀྲུ་བཤལ་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $200 “The well-gone Vibhaktagātra, when a dyer,#173 |#| Washed the clothing |#| Of the well-gone Masses of Light |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ ཆོས་ འོད་ ཀྱིས་ ནི་ གྲོང་ དག་ དང་ །_། ཡུལ་འཁོར་ རྣམས་ སུ་ ཕ་རོལ་ ཕྱིན་ དྲུག་ སྒྲ་ བསྒྲགས་ ནས །_། |#| དེ་བཞིན་ གཤེགས་པ་ དཔལ་ ནི་ བརྩེགས་པ་ དེ་ ལ་ ཡང་ །_། དང་པོ་ ཉིད་ དུ་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $201 “The thus-gone Dharmaprabhāsa |#| Taught the six perfections throughout towns and lands |#| Before the thus-gone Glorious Peak |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཀུན་གཟིགས་ སྟོབས་ ཀྱི་ འཁོར་ལོ ས་ སྒྱུར་བ འི་ ཚེ །_། གཙུག་ལག་ཁང་ མཆོག་ བྱེ་བ་ དྲུག་ཅུ་ བྱེད་ [298a] བཅུག་ ནས །_། |#| དེ་བཞིན་ གཤེགས་པ་ མྱ་ངན་མེད་ པར་ དགའ་ དེ་ ལ །_། དང་པོ་ ཉིད་ དུ་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $202 “The well-gone Nikhiladarśin, when a universal monarch of strength, |#| Constructed six hundred million supreme monastic residences [298.a] |#| Before the thus-gone Delighting in Freedom from Sorrow |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཡོན་ཏན་ འོད་གསལ་ ཕྱག་དར་ པར །_། གྱུར་ ཚེ་ བདེ་གཤེགས་ ཡུལ་འཁོར་ ལྷ་ དེ་ ལ །_། རྡོ་ལེབ་ གདན་ དག་ དབུལ་བ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $203 “The well-gone Guṇaprabhāsa, when a sweeper, |#| Offered stone slabs as seats |#| To the well-gone God of the Land |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ ཟླ་ཞལ་ བྲམ་ཟེ འི་ བུར་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ སེང་གེ་ དགའ་བ འི་ དབྱངས་ དེ་ ལ །_། ཀན་ ཏ་ ར་ ཡི་ མེ་ཏོག་ དག་ ནི་ གཏོར་ ནས་ |#| ཀྱང་ །_། དང་པོ་ ཉིད་ དུ་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $204 “The thus-gone Śaśivaktra, when the son of a brahmin, |#| Scattered kāntāra flowers |#| Before the thus-gone Lion of Joyous Melody |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ རིན་ཆེན་ འོད་ ནི་ དེད་དཔོན་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ འོད་ མཐའ་ ཡ ས་ དེ་ ལ །_། རིན་པོ་ཆེ་ ཡི་ སྒྲོན་མ་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $205 “The well-gone Ratnaprabha, when a captain, |#| Offered a jewel lamp |#| To the thus-gone Infinite Light |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ རིན་ཆེན་ ཏོག་ ནི་ ལྕགས་མགར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ མཐོང་ ན་ |#| དགའ་ དེ་ |#| ལ །_། ལྗགས་ བཞ ར་ དག་ ནི་ དབུལ་བ་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $206 “The well-gone Ratnaketu, when a blacksmith, |#| Offered a tongue scraper |#| To the thus-gone Delightful to See |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ གྲགས་ བླ་ ཆང་ ཚོང་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ སྒྲོན་མ འི་ རྒྱལ་པོ་ ལ །_། འཛམ་བུ འི་ རོ་ བྲོ་བ་ དག་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $207 “The thus-gone Yaśottara, when an alcohol vendor, |#| Offered jambu fruit juice |#| To the thus-gone Royal Lamp |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ འོད་བྱེད་ ཚོང་དཔོན་ བུར་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ དཔལ་ གྱི་ ཏོག་ དེ་ ལ །_། མུ་ ཤི་ ཀག་ ཤ འི་ མེ་ཏོག་ གཏོར་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $208 “The well-gone Prabhākara, when a merchant’s son, |#| Scattered muśikaka flowers |#| Before the thus-gone Crest of Glory |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ གཟི་བརྗིད་ དཔག་མེད་ ཕྲེང་རྒྱུད་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཕྱོགས་ སུ་ རྣམ་ གྲགས་ ལ །_། པད་མ་ འདབ་བརྒྱ་པ་ དག་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $209 “The well-gone Amitatejas, when a garland maker, |#| Offered lotus flowers with one hundred petals |#| To the thus-gone Universally Renowned |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ དུས་མཁྱེན་ གོས་ འཚོང་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ སྤྱན་ སྡུག་ དེ་ ལ་ ནི །_། རས་ཡུག་ དག་ ནི་ དབུལ་བ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $210 “The thus-gone Velāma, when a garment merchant, |#| Offered a length of cotton fabric |#| To the thus-gone Lovely Eyes |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སེང་གེ འི་ སྐུ་ ནི་ སྤོས་ འཚོང་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཟླ་བ འི་ ཏོག་ དེ་ ལ །_། སྤོས་ ཀྱི་ ཕུར་མ་ དག་ ནི་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $211 “The well-gone Siṃhagātra, when an incense merchant, |#| Offered fragrant powders#174 |#| To the thus-gone Moon Crest |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ མཁས་ བློ་ ཚོང་དཔོན་ ཁོལ་པོ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ འཇིགས་མེད་ སྦྱིན་ དེ་ ལ །_། མེ་ཏོག་ ཆུན་པོ་ དག་ ནི་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $212 “The well-gone Vidumati, when the servant of a merchant, |#| Offered a bouquet of flowers |#| To the thus-gone Gift of Fearlessness |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ རྒྱལ་ དཀའ་ ལྷ འི་ བུ འི་ ཚེ །_། [298b] དེ་བཞིན་ གཤེགས་པ་ རྒྱུ་སྐར་ རྒྱལ་པོ་ ལ །_། མེ་ཏོག་ མན་ དཱ་ ར་བ་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $213 “The thus-gone Durjaya, when a divine son, [298.b] |#| Offered mandārava flowers |#| To the thus-gone Star King |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ ཡོན་ཏན་ ཕུང་པོ་ ནི །_། སཱལ་ ཆེན་ ལྟ་བུ འི་ བྲམ་ཟེ འི་ བུར་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཟླ་བ་ ལྷ་ དེ་ ལ །_། ཕྲེང་ ཕུལ་ དང་པོ ར་ བྱང་ཆུབ་ སེམས་བསྐྱེད་ དོ །_།
en: $214 “The thus-gone Guṇaskandha, when the son of a prosperous brahmin, |#| Offered a garland |#| To the thus-gone Moon God |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ ཟླ་ ཏོག་ སྤོས་ འཚོང་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཉི་མ འི་ འོད་ དེ་ ཡི །_། ཁང་པ་ བརྩེགས་པ ར་ སྤོས་ བྱུག་ ཕྱིར་ ཕུལ་ ནས །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $215 “The thus-gone Śaśiketu, when an incense merchant, |#| Offered incense fumes within the multistoried mansion |#| Of the thus-gone Sunlight |#| And in doing so first gave rise to the mind of awakening.

source: !དེ་བཞིན་ གཤེགས་པ་ མཐུ་ཐོབ་ ཤིང་ སྲུངས་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ གྲགས་པ་ ཆེ་ དེ་ ལ །_། དགུན་ ཤིང་ དག་ ནི་ དབུལ་བ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $216 “The thus-gone Sthāmaprāpta, when a forest guard, |#| Offered grapes#175 |#| To the thus-gone Great Fame |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ མཐུ་རྩལ་ མཐའ་ ཡ ས་ ཚོང་དཔོན་ གྱི །_། བུ་ ཚེ་ དེ་བཞིན་ གཤེགས་པ་ འཇམ་དབྱངས་ ལ །_། སེ་འབྲུ་ དག་ ནི་ དབུལ་བ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $217 “The well-gone Anantavikrāmin, when the son of a merchant, |#| Offered pomegranates |#| To the thus-gone Gentle Melody |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཟླ་བ་ བྲམ་ཟེ འི་ བུར་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ སྟོན་པ ར་ དགྱེས་ དེ་ ལ །_། ཨུད་ པལ་ ཆང་པ་ གང་ཞིག་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $218 “The well-gone Candra, when a brahmin’s son, |#| Offered a handful of utpalas |#| To the thus-gone Delighting in Teaching |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ དྲི་མེད་ ཚོང་དཔོན་ གྱི །_། བུ་ ཚེ་ དེ་བཞིན་ གཤེགས་པ་ གྲགས་ བླ་ ལ །_། མེ་ཏོག་ བར་ ཤིག་ སྐྱེ་བ འི་ ས་གཞི་ ཕུལ །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $219 “The thus-gone Vimala, when the son of a merchant, |#| Offered a field of vārṣikī flowers |#| To the thus-gone Highest Fame |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ དོན་ ཀུན་གཟིགས་པ་ དེད་དཔོན་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ལྷ་ ཡི་ རྒྱལ་པོ་ ལ །_། མུ་ཏིག་ དག་ གི་ ཕྲེང་བ་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $220 “The well-gone Sarvārtha­darśin, when a captain, |#| Offered a pearl garland |#| To the thus-gone King of Gods |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ དཔའ་བོ་ སྤོས་ འཚོང་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ དམར་སེར་ འོད་ དེ་ ལ །_། ཙན་དན་ དག་ གི་ གདན་ཁྲི་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $221 “The thus-gone Śūra, when an incense merchant, |#| Offered a sandalwood throne |#| To the thus-gone Orange Light |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ འབྱོར་ལྡན་ ཚོང་འདུས་པ་ ཡི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བདེ་བ ར་ འདུད་ དེ་ ལ །_། སྙུན་ རྐྱེན་ གསོས་ སྨན་མར་ དག་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $222 “The well-gone Samṛddha, when a market merchant, |#| Offered medicinal butter |#| To the thus-gone Delightful Veneration |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ བསོད་ནམས་ བ་ལང་ རྫི་ ཡི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བློ་གྲོས་ སེམས་ དེ་ ལ །_། སྣོད་ དག་ ཞོ་ ཡིས་ བཀང་ སྟེ་ |#| ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $223 “The well-gone Puṇya, when a cowherd, |#| Offered vessels filled with yogurt |#| To the thus-gone Intelligent Mind |#| And in doing so first gave rise to the mind of awakening. [299.a]

source: [299a] བདེ་གཤེགས་ སྒྲོན་མ་ ཚལ་ གྱི་ ལས་ བྱེད་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ དབྱིག་ གསལ་ དེ་ |#| ལ་ ནི །_། ཨ་མྲ འི་ འབྲས་བུ་ དག་ ནི་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $224 “The well-gone Pradīpa, when a garden worker, |#| Offered mango fruits |#| To the thus-gone Luminous Treasure |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ ཡོན་ཏན་ འོད་འཕྲོ་ ནི །_། རོ་ བྲོ་ འཚོང་ ཚེ་ དེ་བཞིན་ གཤེགས་པ་པོ །_། སྐྱོན་ ཞི་ དེ་ ལ་ཁ་ ར འི་ དུམ་བུ་ ཕུལ །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $225 “The thus-gone Guṇārci, when a juice vendor, |#| Offered a piece of sugar |#| To the thus-gone Pacification of Flaws |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ བློ་ ཡངས་ ཀུན་ རྒྱུ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ རྒྱུ་སྐར་ རྒྱལ་པོ་ ལ །_། ལོ་མ་ དག་ གི་ རི་ལུ་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $226 “The thus-gone Vipulabuddhi, when a wandering ascetic, |#| Offered a leaf ball |#| To the thus-gone Star King |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ལེགས་སྐྱེས་ རྒྱ་མཚོ འི་ ཚོང་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བསྙེངས་ དང་ བྲལ་ དེ་ |#| ལ །_། ན་བཟའ་ སྟོང་ཕྲག་ བརྒྱ་ ནི་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $227 “The well-gone Sujāta, when a seafaring merchant, |#| Offered one hundred thousand garments |#| To the thus-gone Fearless |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ ནོར་ལྷ་ ཤིང་ འཚོང་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བློ་གསལ་ དེ་ ལ་ ནི །_། རྩྭ་ བམ་ སྒྲོན་མེ་ དག་ ནི་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $228 “The thus-gone Vasudeva, when a wood merchant, |#| Offered dry grass torches |#| To the thus-gone Clear Mind |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཡིད་གཉིས་ སྤོང་བ་ གསེར་མགར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཡིད་གཉིས་ སེལ་ མཛད་ ལ །_། གསེར་ གྱི་ མེ་ཏོག་ དག་ ནི་ གཏོར་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $229 “The well-gone Vimatijaha, when a goldsmith, |#| Scattered flowers of gold |#| To the thus-gone Dispeller of Doubt |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ འཛིན་པ་ དཔག་མེད་ གསེར་ རྟོག་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བྱམས་པ འི་ དཔལ་ དེ་ ལ །_། གསེར་ ནི་ སྤར་གང་ གཏོར་ ཏེ་ |#| ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $230 “The well-gone Amitadhara, when a gold dealer, |#| Scattered handfuls of gold |#| Before the thus-gone Glory of Love |#| And in doing so first gave rise to the mind of awakening.

source: !དེ་བཞིན་ གཤེགས་པ་ མཆོག་ སྲིད་སྡེ་ དཔོན་ གྱི །_། བུ་ ཚེ་ དེ་བཞིན་ གཤེགས་པ་ གཙོ་ མཆོག་ ལ །_། གསེར་ ལས་ བྱས་པ འི་ གདུགས་ དག་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $231 “The thus-gone Vararuci, when the son of a captain, |#| Offered parasols made of gold |#| To the thus-gone Supreme Leader |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ ཆོམས་ མེད་ ལྕགས་མགར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ སྣ་ཚོགས་ གསུང་ དེ་ ལ །_། ཨ་ཧ་ ཏ་ ཀ་ དབུལ་བ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $232 “The thus-gone Anihata, when a blacksmith, |#| Offered ahataka#176 |#| To the thus-gone Diverse Teaching |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ མི་ གནས་ གྲོང་ཁྱེར་ རྟེན་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཀུན་ ཏུ་ གཟིགས་ དེ་ |#| ལ །_། མེ་ཏོག་ རངས་པ་ དག་ ནི་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $233 “The well-gone Asthita, when a city beggar, |#| Offered ravishing flowers |#| To the thus-gone Universal Vision |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ དེར་ གནས་ ཐགས་མཁན་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཟླ་བ་ གཟིགས་ དེ་ |#| ལ །_། སྐུ་ རེགས་ དག་ ནི་ དབུལ་བ་ [299b] བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $234 “The thus-gone Tacchaya, when a weaver, |#| Offered belts |#| To the thus-gone Moon Vision [299.b] |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཚོགས་ཆེན་ གཙོ་བོ་ མགོན་མེད་ བུར་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བདུད་ ཟིལ་གནོན་པ་ དེ་ ལ་ ནི །_། མོན་སྲན་ གྲེའུ་ ཡི་ འབྲུ་མར་ མར་མེ་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ་ ཉིད་ དུ་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $235 “The well-gone Gaṇimukha, when the son of a destitute, |#| Offered a lamp with māṣa bean oil |#| To the thus-gone Conqueror of the Māras |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ འགྲོ་བ འི་ འོད་ཟེར་ འཁོར་ལོ ས་ སྒྱུར་བ འི་ ཚེ །_། བདེ་གཤེགས་ ཤིང་རྟ་ ཆེན་པོ་ འཁོར་བཅས་ བྱེ་ སྟོང་ ལ །_། རྒྱལ་པོ འི་ ཞལ་ཟས་ དག་ ནི་ བྲིམ་པ་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ་ ཉིད་ དུ་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $236 “The well-gone Jagadraśmi, when a universal monarch, |#| Offered royal food |#| To the well-gone Great Chariot and his ten billionfold retinue, |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ ཕལ་ཆེན་ འཁོར་ལོ ས་ སྒྱུར་བ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ སེང་གེ འི་ སྟོབས་ ཀྱིས་ གཤེགས་ དེ་ ལ །_། དཔག་ཚད་ བཅུ་གཉིས་ ཁྱོན་ ཙམ་ སྐྱེད་མོས་ཚལ་ ཕུལ་ ནས །_། |#| དང་པོ་ ཉིད་ དུ་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $237 “The thus-gone Prabhūta, when a universal monarch, |#| Offered a twelve-league-large park |#| To the thus-gone Gone with Lion Strength#177 |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ རྒྱལ་ ནི་ འབྲུ་མར་ མཁན་ གྱི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ འོད་ཟེར་ ཚིམ་ དེ་ ལ །_། ཞབས་ བསྐུ་བ་ དག་ དབུལ་བ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $238 “The well-gone Puṣya, when an oil producer, |#| Offered foot massage |#| To the thus-gone Satisfying Radiance |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ གཟི་བརྗིད་ མཐའ་ ཡ ས་ ཁྲུས་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཀུན་ ཏུ་ སྦེད་པ་ དེ་ ལ་ ནི །_། འདག་པ འི་ ཆལ་ གྱིས་ སྣོད་ དག་ བཀང་ སྟེ་ |#| ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ་ ཉིད་ དུ་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $239 “The thus-gone Anantatejas, when a bath attendant, |#| Offered vessels filled with soap |#| To the thus-gone Thoroughly Hidden |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ དོན་ གྱི་ བློ་གྲོས་ ནད་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ དོན་གྲུབ་ མཐུ་རྩལ་ ལ །_། ཁ་ར འི་ དུམ་བུ་ དག་ ནི་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $240 “The well-gone Arthamati, when ill, |#| Offered pieces of sugar |#| To the thus-gone Powerful Accomplishment |#| And in doing so first gave rise to the mind of awakening.
